notes/000-Inbox-收集/Arduino指纹锁避坑.org
#+title: Arduino+AS608指纹锁避坑记
#+options: h:1 num:t toc:t
#+options: html-postamble:nil
#+language:zh-CN 

* 关于找不到传感器的问题

使用Arduino 连接AS608指纹模块，使用 Ardafurit fingureprint sensor library 的示例，
下载时第一次可能出现找不到传感器的情况，大多数时候还是没有问题的，写入之后使用单
独的电源供电，开机却总是找不到传感器（Did not find fingureprint sensor），考虑串
口线接触不良、外部干扰等情况，我通过近50次测试，找到的原因是指纹模块还没有启动起
来。

AS608模块具有自己的处理器和存储设备，通过串口和Arduino 连接，它的启动需要一定时
间，经测试大概需要5至10秒，在电脑连接下载线测试时一般情况下指纹模块已经启动好了，
而在实际应用中直接上电的情况下，如果只做一次测试（如库中的示例程序），往往出现找
不到模块的情况。

解决办法是，不断测试是否成功，如果不成功则使用 resetFunc() 复位，经测试，在硬件
没有问题的情况下，这是很可靠的。

* 关于内侧开门的问题

曾将开关连接到处理器上，检测按键输入再开锁，测试发现并不好用，且容易出现BUG。一
是在主板没有加电时开关是不可用的；二是如果按键输入引脚出现脱落等情况，处理器得到
的输入是随机的，可能出现不停自动开关的情况。

解决办法是，将开关接到继电器的输出端。当然，有一个问题是，延时开关的效果要另外实
现了。

此记。

本作品采用[[http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh][知识共享署名-非商业性使用-禁止演绎 3.0 未本地化版本许可协议]] 进行许可。

